statistics.json
{
  "Get profile id" : {
    "transaction" : "Get profile id",
    "sampleCount" : 1,
    "errorCount" : 1,
    "errorPct" : 100.0,
    "meanResTime" : 5.0,
    "medianResTime" : 5.0,
    "minResTime" : 5.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 5.0,
    "throughput" : 200.0,
    "receivedKBytesPerSec" : 10.3515625,
    "sentKBytesPerSec" : 0.0
  },
  "specializations" : {
    "transaction" : "specializations",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 101.0,
    "medianResTime" : 101.0,
    "minResTime" : 101.0,
    "maxResTime" : 101.0,
    "pct1ResTime" : 101.0,
    "pct2ResTime" : 101.0,
    "pct3ResTime" : 101.0,
    "throughput" : 9.900990099009901,
    "receivedKBytesPerSec" : 39.81667698019802,
    "sentKBytesPerSec" : 7.174350247524752
  },
  "cities" : {
    "transaction" : "cities",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 101.0,
    "medianResTime" : 101.0,
    "minResTime" : 101.0,
    "maxResTime" : 101.0,
    "pct1ResTime" : 101.0,
    "pct2ResTime" : 101.0,
    "pct3ResTime" : 101.0,
    "throughput" : 9.900990099009901,
    "receivedKBytesPerSec" : 7.348391089108911,
    "sentKBytesPerSec" : 7.087329826732673
  },
  "UPDATE course to PUBLIC" : {
    "transaction" : "UPDATE course to PUBLIC",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 140.0,
    "medianResTime" : 140.0,
    "minResTime" : 140.0,
    "maxResTime" : 140.0,
    "pct1ResTime" : 140.0,
    "pct2ResTime" : 140.0,
    "pct3ResTime" : 140.0,
    "throughput" : 7.142857142857142,
    "receivedKBytesPerSec" : 13.469587053571427,
    "sentKBytesPerSec" : 9.1796875
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 9,
    "errorCount" : 2,
    "errorPct" : 22.222221,
    "meanResTime" : 615.2222222222222,
    "medianResTime" : 140.0,
    "minResTime" : 5.0,
    "maxResTime" : 2967.0,
    "pct1ResTime" : 2967.0,
    "pct2ResTime" : 2967.0,
    "pct3ResTime" : 2967.0,
    "throughput" : 1.143728555089592,
    "receivedKBytesPerSec" : 2.280135063222773,
    "sentKBytesPerSec" : 0.9665101982462829
  },
  "Create course" : {
    "transaction" : "Create course",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 145.0,
    "medianResTime" : 145.0,
    "minResTime" : 145.0,
    "maxResTime" : 145.0,
    "pct1ResTime" : 145.0,
    "pct2ResTime" : 145.0,
    "pct3ResTime" : 145.0,
    "throughput" : 6.896551724137931,
    "receivedKBytesPerSec" : 2.417834051724138,
    "sentKBytesPerSec" : 8.580280172413794
  },
  "Login, create course and lifter all courses" : {
    "transaction" : "Login, create course and lifter all courses",
    "sampleCount" : 1,
    "errorCount" : 1,
    "errorPct" : 100.0,
    "meanResTime" : 5537.0,
    "medianResTime" : 5537.0,
    "minResTime" : 5537.0,
    "maxResTime" : 5537.0,
    "pct1ResTime" : 5537.0,
    "pct2ResTime" : 5537.0,
    "pct3ResTime" : 5537.0,
    "throughput" : 0.18060321473722232,
    "receivedKBytesPerSec" : 3.2404520159833847,
    "sentKBytesPerSec" : 1.3735721058334838
  },
  "profiles/me" : {
    "transaction" : "profiles/me",
    "sampleCount" : 1,
    "errorCount" : 1,
    "errorPct" : 100.0,
    "meanResTime" : 101.0,
    "medianResTime" : 101.0,
    "minResTime" : 101.0,
    "maxResTime" : 101.0,
    "pct1ResTime" : 101.0,
    "pct2ResTime" : 101.0,
    "pct3ResTime" : 101.0,
    "throughput" : 9.900990099009901,
    "receivedKBytesPerSec" : 5.221225247524752,
    "sentKBytesPerSec" : 7.135674504950495
  },
  "login" : {
    "transaction" : "login",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2967.0,
    "medianResTime" : 2967.0,
    "minResTime" : 2967.0,
    "maxResTime" : 2967.0,
    "pct1ResTime" : 2967.0,
    "pct2ResTime" : 2967.0,
    "pct3ResTime" : 2967.0,
    "throughput" : 0.3370407819346141,
    "receivedKBytesPerSec" : 0.34428189248399055,
    "sentKBytesPerSec" : 0.2764787664307381
  },
  "UPDATE created course" : {
    "transaction" : "UPDATE created course",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 146.0,
    "medianResTime" : 146.0,
    "minResTime" : 146.0,
    "maxResTime" : 146.0,
    "pct1ResTime" : 146.0,
    "pct2ResTime" : 146.0,
    "pct3ResTime" : 146.0,
    "throughput" : 6.8493150684931505,
    "receivedKBytesPerSec" : 12.889287243150685,
    "sentKBytesPerSec" : 8.77568493150685
  },
  "GET filtered courses" : {
    "transaction" : "GET filtered courses",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1831.0,
    "medianResTime" : 1831.0,
    "minResTime" : 1831.0,
    "maxResTime" : 1831.0,
    "pct1ResTime" : 1831.0,
    "pct2ResTime" : 1831.0,
    "pct3ResTime" : 1831.0,
    "throughput" : 0.5461496450027307,
    "receivedKBytesPerSec" : 4.074255017749864,
    "sentKBytesPerSec" : 0.4442799358274167
  }
}